---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ExtrusionEndParam
source: html/52a439e3-45ca-8259-8a2d-16a5ae3e3769.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ExtrusionEndParam Property

"Extrusion End"

## Syntax (C#)
```csharp
public static ForgeTypeId ExtrusionEndParam { get; }
```